Tekla.Structures.CatalogInternal.CatalogInternalOperation
Internal operations

Tekla.Structures.CatalogInternal.CatalogInternalOperation.ImportCustomComponentsFromPathWithUpdateCheck(System.String,System.Boolean)
Import custom components from path, with check for existing components.
Path: The path to load components from.
ForcedUpdate: Whether to force update of existing components.
Returns: True if successful.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.DeleteMultiCSProfile(Tekla.Structures.Catalogs.ParametricProfileItem)
Deletes the multi CS profile item in the profile database.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.DeleteSketchedProfile(Tekla.Structures.Catalogs.ParametricProfileItem)
Deletes the sketched profile item in the profile database.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.SelectProfileItemByTypeAndSubType(Tekla.Structures.Catalogs.ProfileItem@,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum,Tekla.Structures.Catalogs.ProfileItem.ProfileItemSubTypeEnum,System.Int32)
Select and read the profile parameters from the specified profile name, type and subtype
profileItem: The empty profile item filled with profile name.
profileItemTypeEnum: The profile item type.
profileItemSubTypeEnum: The profile item sub type.
crossSectionNumber: The cross section number of the the profile.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.AddProfileItem(Tekla.Structures.Catalogs.ProfileItem,System.String)
Adds a new profile item using the given profile item type and subtype.
profileItem: Input profile item.
newName: Name of the new profile.
Returns: true on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.RenameProfileItem(Tekla.Structures.Catalogs.ProfileItem,System.String)
Rename profile item.
New name cannot be in use.
New name cannot be "UNNAMED" with lower or upper case.
profileItem: The profile item.
newName: New name for the profile item.
Returns: true on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.IsValidUnusedProfileName(System.String)
Checks the given name is a valid and unused profile name.
profileName:
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.GetProfileItemCrossSection(System.String,System.Boolean,Tekla.Structures.Catalogs.ProfileItemCrossSection@)
Gets the cross section for the given profile name base on cross section number.
profileName: The profile name.
isParametric: Specify is the profile is parametric or not.
profileItemCrossSection: The profile item cross section.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.ModifyProfileItemProperties(System.String,Tekla.Structures.Catalogs.ProfileItemCrossSection)
Modifies the properties of given profile name base on cross-section number.
profileName: The profile name.
profileItemCrossSection: The profile item cross-section.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.ModifyProfileItemProperties(System.String,System.Int32,Tekla.Structures.Catalogs.ProfileItem.ProfileItemParametersTypeEnum,System.Collections.Generic.IList{Tekla.Structures.Catalogs.ProfileItemParameter})
Modifies the properties of given profile name base on cross-section number and parameters type.
profileName: The profile name.
crossSectionNumber: The cross-section number.
parametersType: The parameters type.
profileItemParameters: The profile item parameters.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.GetProfileItemPropertiesByTypeAndSubType(System.Int32,System.Int32,System.Collections.Generic.List{Tekla.Structures.Catalogs.ProfileItemParameter}@)
Get the profile item properties by type and sub type.
type: The profile type.
subType: The profile sub type.
profileItemProperties: The profile item properties.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.CreateSavePoint
Rollback the profile database to the last save point.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.RollbackToSavePoint
Rollback the profile database to the last save point.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.SaveProfileDatabaseNew
Saves the profile database.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.DeleteUserParametricProfile(Tekla.Structures.Catalogs.ParametricProfileItem)
Deletes the user defined parametric profile item in the profile database.
Returns: True on success.

Tekla.Structures.CatalogInternal.CatalogInternalOperation.GetProfileItemProperties(System.String,System.Int32,Tekla.Structures.Catalogs.ProfileItem.ProfileItemParametersTypeEnum,System.Boolean)
Get the profile item properties for the given profile name and parameters type.
profileName: The profile name.
crossSectionNumber: The cross-section number
parametersType: The parameters type.
isParametric: The is parametric flag.